[
  {
    "version": "[NEXT_VERSION]",
    "date": "[NEXT_DATE]",
    "changes": [
      "Add a desktop sidebar toggle button so navigation can be collapsed to an icon-only rail and expanded again as needed.",
      "Keep collapsed sidebar behavior consistent with WealthTrack styling, including icon-only navigation labels and remembered desktop preference.",
      "Replace the desktop sidebar toggle icon with clearer chevrons so it is obvious that the menu can collapse and expand."
    ]
  },
  {
    "version": "1.1.108",
    "date": "2026-03-01",
    "changes": [
      "Refresh contributor and README documentation so required Node.js, npm, and Tailwind CSS versions match the current project tooling.",
      "Add a quick development tooling reference in the README so setup steps and library versions are easier to verify before running checks."
    ]
  },
  {
    "version": "1.1.106",
    "date": "2026-03-01",
    "changes": [
      "Add new Playwright coverage for first-time welcome guidance and navigation from the WealthTrack brand shortcut.",
      "Verify first-time content visibility controls in Settings so onboarding guidance can be hidden and restored reliably."
    ]
  },
  {
    "version": "1.1.105",
    "date": "2026-03-01",
    "changes": [
      "Clarify contributor guidance that updates to jest.config.js are strictly prohibited unless explicitly requested by a maintainer.",
      "Raise Jest coverage gates to 80% for statements, branches, functions, and lines.",
      "Focus default coverage reporting on core utility logic and add extra version/date utility tests to keep the stricter threshold green.",
      "Restore assets/js/app.js to Jest coverage reports and document the rule so future coverage updates do not remove it.",
      "Align Jest coverage enforcement with global 80% thresholds across statements, branches, functions, and lines while keeping assets/js/app.js in the report."
    ]
  },
  {
    "version": "1.1.104",
    "date": "2026-03-01",
    "changes": [
      "Expand Jest integration coverage with additional end-to-end style flows for snapshot comparison, profile deletion, and encrypted import handling.",
      "Raise enforced Jest global function coverage to 80% while preserving the existing statement threshold."
    ]
  },
  {
    "version": "1.1.103",
    "date": "2026-03-01",
    "changes": [
      "Set the global Jest coverage requirement to 70% across statements, branches, functions, and lines.",
      "Remove the dedicated coverage override for assets/js/app.js so all files follow the same global rule.",
      "Add targeted forecast and stress-test Jest coverage tests for app goal projection and deposit scheduling logic."
    ]
  },
  {
    "version": "1.1.102",
    "date": "2026-03-01",
    "changes": [
      "Fix Jest coverage gating by adding realistic app.js coverage thresholds aligned with current measured baseline while preserving strict global thresholds for core tracked files.",
      "Remove the special Jest coverage threshold override for app.js and add broader app-level tests to raise measured coverage.",
      "Expand Jest coverage with additional app helper tests and include assets/js/app.js in default coverage collection."
    ]
  },
  {
    "version": "1.1.101",
    "date": "2026-03-01",
    "changes": [
      "Restore the mobile navigation backdrop so page content stays visible with a soft blur instead of turning fully black.",
      "Add an automated mobile menu check to confirm the overlay keeps blur styling after future CSS upgrades."
    ]
  },
  {
    "version": "1.1.98",
    "date": "2026-02-28",
    "changes": [
      "Document Playwright browser installation and optional Linux dependency setup to prevent missing executable failures during E2E runs.",
      "Add guidance for suppressing NO_COLOR and FORCE_COLOR warning noise when running Playwright tests."
    ]
  },
  {
    "version": "1.1.97",
    "date": "2026-02-28",
    "changes": [
      "Upgrade Tailwind CSS from v3 to v4 and migrate the stylesheet build to the new Tailwind v4 tooling.",
      "Refresh development dependencies with the latest patch update for Node.js type definitions.",
      "Clarify npm runtime compatibility by requiring Node.js 20+ in project metadata and documentation to match the upgraded Tailwind v4 toolchain.",
      "Fix layout regressions after the Tailwind v4 upgrade by removing duplicate modal scroll containers and preventing dashboard cards from overflowing off-screen.",
      "Keep the left navigation width stable on Financial Inputs and harden forecast event tests so local npm test runs stay reliable.",
      "Restore the hand-pointer cursor on desktop sidebar navigation and silence the recurring npm proxy warning in local runs."
    ]
  },
  {
    "version": "1.1.96",
    "date": "2026-02-28",
    "changes": [
      "Refresh and rationalise utility tests by replacing weak assertions with deterministic checks and broader edge-case coverage for random sampling and numeric fallback behaviour.",
      "Update npm development dependencies to include the latest patch release for Node.js type definitions."
    ]
  },
  {
    "version": "1.1.95",
    "date": "2026-02-28",
    "changes": [
      "Increase Jest coverage for utility helpers by adding edge-case tests for NI threshold fallbacks, semantic version comparisons, and default compounding periods."
    ]
  },
  {
    "version": "1.1.93",
    "date": "2026-02-28",
    "changes": [
      "Raise Jest coverage enforcement to require at least 90% statements, branches, functions, and lines across tracked files."
    ]
  },
  {
    "version": "1.1.92",
    "date": "2026-02-28",
    "changes": [
      "Add broad integration-style Jest coverage tests for app interactions and restore coverage reporting to include app.js alongside utilities, substantially increasing measured coverage of the main application logic."
    ]
  },
  {
    "version": "1.1.91",
    "date": "2026-02-28",
    "changes": [
      "Increase automated Jest coverage by adding a bootstrap test that exercises app startup flows in a browser-like environment."
    ]
  },
  {
    "version": "1.1.90",
    "date": "2026-02-28",
    "changes": [
      "Increase automated unit test coverage by adding extra utility function tests for tax, formatting, version parsing, and student loan scenarios."
    ]
  },
  {
    "version": "1.1.88",
    "date": "2026-02-28",
    "changes": [
      "Expand Jest unit tests to significantly increase test coverage for core application logic including growth calculations, event handling, liability tracking, and tax details.",
      "Expose additional internal calculation functions from the application module to facilitate comprehensive unit testing."
    ]
  },
  {
    "version": "1.1.86",
    "date": "2026-02-28",
    "changes": [
      "Increase Jest unit test coverage by over 15%, exceeding the 10% target.",
      "Add comprehensive tests for core application logic including forecasting, net worth, and data normalization.",
      "Achieve 100% line coverage for utility functions.",
      "Enable unit testing for internal application state by adding secure getter and setter exports."
    ]
  },
  {
    "version": "1.1.84",
    "date": "2026-02-28",
    "changes": [
      "Add comprehensive Playwright E2E tests for financial inputs and UI interactions.",
      "Ensure users can add and edit income, expenses, assets, liabilities, and goals via automated tests.",
      "Verify card expansion/collapsing and mobile menu functionality across different viewports."
    ]
  },
  {
    "version": "1.1.83",
    "date": "2026-02-28",
    "changes": [
      "Add automated end-to-end tests to verify that the app remains fully accessible after loading sample data, ensuring a reliable experience for new users."
    ]
  },
  {
    "version": "1.1.82",
    "date": "2026-02-28",
    "changes": [
      "Add automated end-to-end tests for each calculator to verify accuracy and ensure long-term reliability."
    ]
  },
  {
    "version": "1.1.81",
    "date": "2026-02-28",
    "changes": [
      "Update GitHub Actions to latest versions and pin to SHA commit hashes for security best practices."
    ]
  },
  {
    "version": "1.1.78",
    "date": "2026-02-28",
    "changes": [
      "Add automated linting checks and instructions to keep code formatting clean and catch errors early before commits."
    ]
  },
  {
    "version": "1.1.76",
    "date": "2026-02-28",
    "changes": [
      "Add automated test suite for utility and calculator functions to improve code reliability.",
      "Add GitHub Actions workflow (pr-test.yml) to run tests and report coverage on pull requests.",
      "Export internal functions in app.js to enable targeted unit testing."
    ]
  },
  {
    "version": "1.1.73",
    "date": "2026-02-28",
    "changes": [
      "Update dependabot configuration to automatically apply only minor and patch updates for dependencies.",
      "Add comprehensive automated test suite to verify application functionality."
    ]
  },
  {
    "version": "1.1.65",
    "date": "2026-02-28",
    "changes": [
      "Show only the five newest snapshots in Save Snapshot by default and add a See more toggle when older entries are available.",
      "Limit the Snapshot History chart to the five latest snapshots so recent progress is easier to read."
    ]
  },
  {
    "version": "1.1.64",
    "date": "2026-02-27",
    "changes": [
      "Give dark mode true black backgrounds for deeper contrast across the app."
    ]
  },
  {
    "version": "1.1.63",
    "date": "2026-02-25",
    "changes": [
      "Fix Android-installed app icons so the WealthTrack logo lines stay white and visible on the dark background."
    ]
  },
  {
    "version": "1.1.60",
    "date": "2026-01-24",
    "changes": [
      "Fix mobile scrolling so the page moves normally even when the navigation menu is closed."
    ]
  },
  {
    "version": "1.1.59",
    "date": "2026-01-03",
    "changes": [
      "Rename the compound and simple interest calculator headings for consistency and add a passive income target calculator to show the investment needed for a chosen payout and return rate."
    ]
  },
  {
    "version": "1.1.58",
    "date": "2025-12-31",
    "changes": [
      "Refresh imported income and expense entries immediately so they appear without restarting after a restore."
    ]
  },
  {
    "version": "1.1.57",
    "date": "2025-12-31",
    "changes": [
      "Keep income and expense entries tied to each profile when exporting and re-importing data, even after resetting the app.",
      "Include the welcome content visibility preference in exports so disabling the intro persists across restores."
    ]
  },
  {
    "version": "1.1.56",
    "date": "2025-12-30",
    "changes": [
      "Add a note to the UK Take Home Pay calculator explaining it uses simplified PAYE assumptions and that payslips may vary."
    ]
  },
  {
    "version": "1.1.55",
    "date": "2025-12-30",
    "changes": [
      "Center the Net Cash Flow stat box on desktop so it spans the card like other insights.",
      "Move the UK Tax Impact Estimator to appear just below UK Take Home Pay in the calculators list."
    ]
  },
  {
    "version": "1.1.54",
    "date": "2025-12-30",
    "changes": [
      "Add a one-off bonus field to the UK take home calculator with a bonus period column and PAYE smoothing comparison so you can see how much tax is held back and when it returns."
    ]
  },
  {
    "version": "1.1.53",
    "date": "2025-12-28",
    "changes": [
      "Color the net cash flow total green for a surplus and red for a shortfall, rename asset contributions in the breakdown, and keep the expenses minus sign aligned on mobile."
    ]
  },
  {
    "version": "1.1.52",
    "date": "2025-12-28",
    "changes": [
      "Tidy the Net Cash Flow card so its header, spacing, and collapse toggle match other collapsible cards."
    ]
  },
  {
    "version": "1.1.51",
    "date": "2025-12-28",
    "changes": [
      "Restore saved income entries when reopening the app so they stay available after closing WealthTrack.",
      "Show Portfolio Insights whenever you have income, expenses, liabilities, or assets so the net cash flow card is accessible without adding an asset first."
    ]
  },
  {
    "version": "1.1.49",
    "date": "2025-12-28",
    "changes": [
      "Add a Portfolio Insights net cash flow card with a monthly income versus expenses breakdown so you can see how the total is calculated."
    ]
  },
  {
    "version": "1.1.48",
    "date": "2025-12-28",
    "changes": [
      "Keep income and expense entries attached to each profile so updates no longer drop previously entered cash flow data."
    ]
  },
  {
    "version": "1.1.46",
    "date": "2025-12-28",
    "changes": [
      "Add a toggle on each asset to keep its recurring contributions out of net cash flow calculations while still forecasting growth."
    ]
  },
  {
    "version": "1.1.45",
    "date": "2025-12-28",
    "changes": [
      "Subtract asset deposits from forecast net cash flow so invested contributions reduce the available surplus in tooltips."
    ]
  },
  {
    "version": "1.1.44",
    "date": "2025-12-28",
    "changes": [
      "Split Financial Inputs into separate Expenses and Liabilities cards so you can track recurring expenses with frequency and start dates underneath Income.",
      "Calculate net cash flow from income minus expenses with a shorter tooltip label, while keeping liabilities managed separately.",
      "Retitle the Goals heading to Goal for consistency."
    ]
  },
  {
    "version": "1.1.43",
    "date": "2025-12-27",
    "changes": [
      "Add future tax year selection through 2029/30 to the take home pay calculator and let you choose salary sacrifice or relief-at-source pension methods with percentage or fixed contributions.",
      "Include relief-at-source tax relief and pre-tax salary sacrifice handling in the pay breakdown while keeping student loan, tax, and NI estimates aligned to the selected year.",
      "Show net cash flow in forecast tooltips and relocate goal achievement stats inside the Future Wealth card for quicker review."
    ]
  },
  {
    "version": "1.1.42",
    "date": "2025-12-27",
    "changes": [
      "Add a UK take home pay calculator with tax code entry, salary sacrifice support, and student loan plan options.",
      "Show surplus income left after liabilities inside forecast breakdowns and charts so you can see how cash flow contributes."
    ]
  },
  {
    "version": "1.1.41",
    "date": "2025-12-27",
    "changes": [
      "Add an Income card to capture recurring net income with edit and delete controls that feed into forecasts.",
      "Reorder Financial Inputs to show Income before Liabilities and Assets, with clearer guidance on when to use each section."
    ]
  },
  {
    "version": "1.1.40",
    "date": "2025-10-24",
    "changes": [
      "Keep WealthTrack data safe by saving it under app-specific browser storage keys so sibling templates can't wipe your settings."
    ]
  },
  {
    "version": "1.1.38",
    "date": "2025-10-12",
    "changes": [
      "Treat any milestone that exceeds the scenario average as an optimistic stretch and refresh the accompanying explanation to match.",
      "Show milestone progress in a neutral tone so falling short no longer appears as red warning text.",
      "Rename the forecast milestones card so it now surfaces suggested milestones in the dashboard copy."
    ]
  },
  {
    "version": "1.1.37",
    "date": "2025-10-12",
    "changes": [
      "Base milestone targets on the average of low, expected, and high forecasts, highlight optimistic stretch goals, and explain how each figure is derived from future projections.",
      "Clarify milestone context with separate scenario lines, explicit optimistic versus conservative labels, and refreshed progress wording."
    ]
  },
  {
    "version": "1.1.36",
    "date": "2025-10-12",
    "changes": [
      "Suggest rounded 1, 3, and 5-year forecast milestones and show how far you are from each target so you can set actionable goals."
    ]
  },
  {
    "version": "1.1.35",
    "date": "2025-10-12",
    "changes": [
      "Ensure the sidebar logo resizes after the menu opens so it stays visible on Safari."
    ]
  },
  {
    "version": "1.1.33",
    "date": "2025-10-09",
    "changes": [
      "Keep stress test sample events in the future so Monte Carlo simulations only model upcoming scenarios."
    ]
  },
  {
    "version": "1.1.32",
    "date": "2025-10-05",
    "changes": [
      "Provide iOS with high-resolution PNG touch icons so the installed app no longer shows a blank tile.",
      "Improve the sidebar logo sizing logic so the brand mark reliably appears when the menu expands on mobile Safari."
    ]
  },
  {
    "version": "1.1.31",
    "date": "2025-10-05",
    "changes": [
      "Keep the passive income date picker from jumping back a day when you choose Sundays or other dates."
    ]
  },
  {
    "version": "1.1.29",
    "date": "2025-10-05",
    "changes": [
      "Add a Scenario Modelling toggle so you can pause or resume all one-off events across forecasts without deleting them."
    ]
  },
  {
    "version": "1.1.28",
    "date": "2025-10-05",
    "changes": [
      "Keep the Run Stress Test button reliably launching Monte Carlo simulations for every goal.",
      "Make Future Portfolio forecasts line up with Scenario Modelling by respecting the date you pick and slotting one-off events into the right month.",
      "Present clearer snapshot comparisons by moving the card alongside other snapshot tools, renaming it for clarity, and listing each portfolio's asset totals.",
      "Preserve the balances you enter by applying recurring deposits at the end of each period, preventing double counting, and simplifying the deposit messaging.",
      "Add an interest rate difference calculator with clearer field labels so you can compare bank offers at a glance."
    ]
  }
]
