[
  {
    "version": "1.1.44",
    "date": "2025-12-28",
    "changes": [
      "Split the Liabilities & Expenses card into separate Expenses and Liabilities cards so you can enter recurring outgoings with names, frequencies, and start dates while keeping debts distinct.",
      "Calculate net cash flow from income minus expenses (excluding liabilities) in forecasts and shorten the tooltip label to simply “Net cash flow.”",
      "Rename the Goals heading to “Goal” for consistent copy across the dashboard."
    ]
  },
  {
    "version": "1.1.43",
    "date": "2025-12-27",
    "changes": [
      "Add future tax year selection through 2029/30 to the take home pay calculator and let you choose salary sacrifice or relief-at-source pension methods with percentage or fixed contributions.",
      "Include relief-at-source tax relief and pre-tax salary sacrifice handling in the pay breakdown while keeping student loan, tax, and NI estimates aligned to the selected year.",
      "Show net cash flow in forecast tooltips and relocate goal achievement stats inside the Future Wealth card for quicker review."
    ]
  },
  {
    "version": "1.1.42",
    "date": "2025-12-27",
    "changes": [
      "Add a UK take home pay calculator with tax code entry, salary sacrifice support, and student loan plan options.",
      "Show surplus income left after liabilities inside forecast breakdowns and charts so you can see how cash flow contributes."
    ]
  },
  {
    "version": "1.1.41",
    "date": "2025-12-27",
    "changes": [
      "Add an Income card to capture recurring net income with edit and delete controls that feed into forecasts.",
      "Reorder Financial Inputs to show Income before Liabilities and Assets, with clearer guidance on when to use each section."
    ]
  },
  {
    "version": "1.1.40",
    "date": "2025-10-24",
    "changes": [
      "Keep WealthTrack data safe by saving it under app-specific browser storage keys so sibling templates can't wipe your settings."
    ]
  },
  {
    "version": "1.1.38",
    "date": "2025-10-12",
    "changes": [
      "Treat any milestone that exceeds the scenario average as an optimistic stretch and refresh the accompanying explanation to match.",
      "Show milestone progress in a neutral tone so falling short no longer appears as red warning text.",
      "Rename the forecast milestones card so it now surfaces suggested milestones in the dashboard copy."
    ]
  },
  {
    "version": "1.1.37",
    "date": "2025-10-12",
    "changes": [
      "Base milestone targets on the average of low, expected, and high forecasts, highlight optimistic stretch goals, and explain how each figure is derived from future projections.",
      "Clarify milestone context with separate scenario lines, explicit optimistic versus conservative labels, and refreshed progress wording."
    ]
  },
  {
    "version": "1.1.36",
    "date": "2025-10-12",
    "changes": [
      "Suggest rounded 1, 3, and 5-year forecast milestones and show how far you are from each target so you can set actionable goals."
    ]
  },
  {
    "version": "1.1.35",
    "date": "2025-10-12",
    "changes": [
      "Ensure the sidebar logo resizes after the menu opens so it stays visible on Safari."
    ]
  },
  {
    "version": "1.1.33",
    "date": "2025-10-09",
    "changes": [
      "Keep stress test sample events in the future so Monte Carlo simulations only model upcoming scenarios."
    ]
  },
  {
    "version": "1.1.32",
    "date": "2025-10-05",
    "changes": [
      "Provide iOS with high-resolution PNG touch icons so the installed app no longer shows a blank tile.",
      "Improve the sidebar logo sizing logic so the brand mark reliably appears when the menu expands on mobile Safari."
    ]
  },
  {
    "version": "1.1.31",
    "date": "2025-10-05",
    "changes": [
      "Keep the passive income date picker from jumping back a day when you choose Sundays or other dates."
    ]
  },
  {
    "version": "1.1.29",
    "date": "2025-10-05",
    "changes": [
      "Add a Scenario Modelling toggle so you can pause or resume all one-off events across forecasts without deleting them."
    ]
  },
  {
    "version": "1.1.28",
    "date": "2025-10-05",
    "changes": [
      "Keep the Run Stress Test button reliably launching Monte Carlo simulations for every goal.",
      "Make Future Portfolio forecasts line up with Scenario Modelling by respecting the date you pick and slotting one-off events into the right month.",
      "Present clearer snapshot comparisons by moving the card alongside other snapshot tools, renaming it for clarity, and listing each portfolio's asset totals.",
      "Preserve the balances you enter by applying recurring deposits at the end of each period, preventing double counting, and simplifying the deposit messaging.",
      "Add an interest rate difference calculator with clearer field labels so you can compare bank offers at a glance."
    ]
  }
]
