[{
    "version": "1.1.40",
    "date": "2025-10-16",
    "changes": [
      "Restore the Layout Settings card with the original theme names, the navigation pin toggle, and the original dark mode switch styling.",
      "Bring back the production-style Version and changelog cards and align the CSS so update controls match the source app."
    ]
  },
  {
    "version": "1.1.39",
    "date": "2025-10-15",
    "changes": [
      "Move the update checker and changelog cards to the settings view and display release notes inside collapsible sections."
    ]
  },
  {
    "version": "1.1.38",
    "date": "2025-10-14",
    "changes": [
      "Left align the mobile header logo and name so the navigation matches the original layout."
    ]
  },
  {
    "version": "1.1.37",
    "date": "2025-10-13",
    "changes": [
      "Remove the mobile menu toggle border so the header matches the original navigation styling.",
      "Restore the template button color palette so primary and secondary actions use the familiar green and gray tones."
    ]
  },
  {
    "version": "1.1.36",
    "date": "2025-10-11",
    "changes": [
      "Recreate the dark mode switch styling so the toggle matches the original visuals on every screen."
    ]
  },
  {
    "version": "1.1.35",
    "date": "2025-10-12",
    "changes": [
      "Restore Font Awesome navigation icons so the sidebar matches the original styling.",
      "Center the dark mode toggle in the mobile drawer to reflect the existing app layout."
    ]
  },
  {
    "version": "1.1.34",
    "date": "2025-10-11",
    "changes": [
      "Bring back the original sidebar, mobile drawer, and card grid so the starter keeps the familiar layout for new projects.",
      "Keep the automatic update checker, changelog card, and appearance controls ready to reuse in any app you build from this shell."
    ]
  },
  {
    "version": "1.1.33",
    "date": "2025-10-09",
    "changes": [
      "Keep stress test sample events in the future so Monte Carlo simulations only model upcoming scenarios."
    ]
  },
  {
    "version": "1.1.32",
    "date": "2025-10-05",
    "changes": [
      "Provide iOS with high-resolution PNG touch icons so the installed app no longer shows a blank tile.",
      "Improve the sidebar logo sizing logic so the brand mark reliably appears when the menu expands on mobile Safari."
    ]
  },
  {
    "version": "1.1.31",
    "date": "2025-10-05",
    "changes": [
      "Keep the passive income date picker from jumping back a day when you choose Sundays or other dates."
    ]
  },
  {
    "version": "1.1.29",
    "date": "2025-10-05",
    "changes": [
      "Add a Scenario Modelling toggle so you can pause or resume all one-off events across forecasts without deleting them."
    ]
  },
  {
    "version": "1.1.28",
    "date": "2025-10-05",
    "changes": [
      "Keep the Run Stress Test button reliably launching Monte Carlo simulations for every goal.",
      "Make Future Portfolio forecasts line up with Scenario Modelling by respecting the date you pick and slotting one-off events into the right month.",
      "Present clearer snapshot comparisons by moving the card alongside other snapshot tools, renaming it for clarity, and listing each portfolio's asset totals.",
      "Preserve the balances you enter by applying recurring deposits at the end of each period, preventing double counting, and simplifying the deposit messaging.",
      "Add an interest rate difference calculator with clearer field labels so you can compare bank offers at a glance."
    ]
  }
]
